Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: These aspects of Lean are explored in a companion tutorial to this one, Programming in Lean 4, though computational aspects of the system will make an appearance here.
ko: Lean의 이러한 측면은 이 교재의 동반 교재인 Programming in Lean에서 더 찾아볼 수 있다. 그렇지만 여기에서도 린의 계산적인 측면을 찾아봅니다.

source: These types vary depending on the first argument, α.
ko: 이 유형은 첫번째 인수 α에 따라 달라집니다.

source: These angle brackets are obtained by typing \< and \>, respectively.
ko: 이 꺽긴 괄호는 \<과 \>을 각각 치는 것으로 쓸 수 있습니다.

source: These are called "inaccessible patterns" for that reason.
ko: 이들은 이런 이유로 "접근할 수 없는 패턴"으로 불립니다.

source: These are not supported by Lean.
ko: 이것들은 린에서 지원되지 않습니다.

source: These are the left and right or-introduction rules.
ko: 이들은 왼쪽과 오른쪽 or-도입 규칙입니다.

source: These are used for type classes, as explained in Chapter Type Classes.
ko: Chapter Type Classes에서 설명할 이들은 유형 클래스에 대해서 사용되었습니다.

source: These can include ordinary mathematical theorems, as well as claims that pieces of hardware or software, network protocols, and mechanical and hybrid systems meet their specifications.
ko: 이 주장들은 평범한 수학적 정리뿐만 아니라 하드웨어와 소프트웨어, 네트워크 프로토콜, 역학적 복합적 시스템이 그들의 명세를 만족하는지에 대한 주장도 포함될 수 있습니다.

source: These require classical reasoning.
ko: 이것은 고전 추론 규칙이 필요합니다.

source: These require classical reasoning:
ko: 이것은 고전 추론 규칙이 필요합니다.

source: These tactics can be used on data just as well as propositions.
ko: 이 전략들은 명제와 마찬가지로 데이터에 사용될 수 있습니다.

source: These variations are equally useful for destructing propositions:
ko: 이 변수들은 명제를 파괴하는데 똑같이 유용합니다.

source: They are commonly known as the right and left and-elimination rules.
ko: 이들은 흔히 오른쪽과 왼쪽 and-제거 규칙으로 알려져 있습니다.

source: They all take values in Prop.
ko: 이들은 Prop형의 모든 값을 받습니다.

source: They are also known as the minor premises.
ko: 이들은 사소한 전제라고도 알려져 있습니다.

source: They are considered "the same" by Lean's type checker, and Lean does its best to recognize and support these identifications.
ko: 이런 것은 린의 유형 검사기가 "같은"것으로 봅니다. 그리고 린은 유형을 인식하고 대조하는데 최선을 다합니다.

source: They are designed to deal with applicative terms, that is, terms of form s t.
ko: 이들은 응용 항을 다루기 위해 설계되었습니다. 즉, s t 꼴의 항입니다.

source: They are not meant to be used directly by the user; rather, the simp tactic is configured to use them when necessary.
ko: 이들은 사용자로부터 직접 사용되기 위한 것이 아니라 오히려 simp 전략이 필요할 때 사용되도록 설정됩니다.

source: They can also include subscripts, which can be entered by typing \_ followed by the desired subscripted character.
ko: 이들은 아래첨자를 넣고자 하는 문자 다음에 \_을 쳐 넣음으로써 아래첨자도 포함할 수 있습니다.

source: They naturally support an incremental style of writing proofs, in which you decompose a proof and work on goals one step at a time.
ko: 그들은 증명을 분해하고 한 번에 한 단계씩 목표를 달성하는 점진적인 스타일의 증명을 자연스럽게 지원합니다.

source: They will be improved over time.
ko: 그들은 시간이 지나면서 개선될 것입니다.

source: They work as follows.
ko: 이는 다음과 같이 동작합니다.

source: Things get much more interesting when the constructors act on elements of the very type being defined.
ko: 생성자가 정의될 바로 그 유형의 원소들에 작용할 때 훨씬 더 흥미롭게 될 것입니다.

source: Think about what is going on here.
ko: 무슨 일이 생긴 건지 생각해보세요.

source: Think about what these expressions mean.
ko: 이 표현식의 의미에 대해 생각해보세요.

source: Think of Type 0 as a universe of "small" or "ordinary" types.
ko: Type 0는 "작은" 또는 "평범한" 유형들의 세계라고 생각해보세요.

source: Think of sunday, monday, ... , saturday as being distinct elements of Weekday, with no other distinguishing properties.
ko: 다른 성질을 구별할 것 없이 sunday, monday, ... , saturday를 Weekday의 구별되는 원소로서 생각해보세요.

source: Think of this as saying "split on cases as to whether m + 3 * k is zero or the successor of some number." The result is functionally equivalent to the following:
ko: 이것을 "m + 3 * k이 0이거나 어떤 수의 계승자인지로 경우가 나뉜다"고 생각합시다. 이 결과는 다음과 기능적으로 동등합니다.

source: Think of this as the function from α to β which maps any value x to the value t.
ko: 이를 임의의 값 x에서 값 t로 대응시키는 α에서 β까지의 함수로 생각해보세요.

source: This form of cases will not revert any hypotheses that also mention the expression in the equation (in this case, m + 3 * k).
ko: 이 cases의 형태는 방정식(이 경우 m + 3 * k)에서 표현식을 언급한 적 있는 어떤 가정도 되돌리지 않을 것입니다.

source: This is not a trivial affair.
ko: 이것은 명백한 문제가 아닙니다.

source: This is useful for discharging goals not supported by conv mode, and applying custom congruence and extensionality lemmas.
ko: 이는 conv 모드에서 지원되지 않는 목표를 실행하고 사용자 정의 합동 및 확장 보조정리를 적용하는 데 유용합니다.

source: This pattern, deriving an arbitrary fact from contradictory hypotheses, is quite common, and is represented by absurd.
ko: 모순적인 가정들로부터 어떤 사실을 얻는 이런 패턴은 꽤 흔하고 absurd로 표현됩니다.

source: This special case is known as singleton elimination.
ko: 이 특별한 경우는 한번에 한 제거(singleton elimination)로도 알려져 있습니다.

source: This annotation can also be written using as ⦃y : Nat⦄, where the unicode brackets are entered as \{{ and \}}, respectively.
ko: 이런 주석은 ⦃y : Nat⦄으로서 사용해 쓸 수도 있습니다. 여기서 유니코드 괄호는 각각 \{{과 \}}으로 쳐서 입력될 수 있습니다.

source: This approach is more robust than using by assumption, because the type of the assumption that needs to be inferred is given explicitly.
ko: 추론될 필요가 있는 가정의 유형은 명백하게 주어져야 하므로 이런 접근법은 by assumption을 사용하는 것보다 더 견고합니다.

source: This approach would provide us with a reasonable way of building assertions and proofs.
ko: 이런 접근은 주장과 증명을 만드는 합리적인 방법을 우리에게 줍니다.

source: This book is designed to teach you to develop and verify proofs in Lean.
ko: 이 책은 Lean에서 증명을 검증하고 세울 수 있도록 당신을 가르치게끔 설계되었습니다.

source: This can be helpful in indicating the separate proofs of multiple subgoals introduced by a tactic.
ko: 이는 전략에 의해 생긴 다수의 하위 목표를의 증명을 나누는 것을 지칭하는데 유용할 수 있습니다.

source: This causes class inference to chain through instances recursively, backtracking when necessary, in a Prolog-like search.
ko: Prolog 같은 탐색에서 필요할 때 역추적하는데 개체를 통한 클래스 추론이 재귀적으로 연결되게 합니다.

source: This clarifies your intention, and Lean will flag an error if the right-hand side of the definition does not have a matching type.
ko: 이것은 당신의 의도를 명확히 만들고 Lean은 정의의 우변에 일치하는 유형이 아닌 경우 에러를 표시할 것입니다.

source: This definition is inconvenient to work with, however.
ko: 이그러나 정의는 작업하기에 불편합니다.

source: This definition of ident here has the same effect as the one above.
ko: ident의 이 정의는 여기서 위의 것과 같이 같은 효과를 갖습니다.

source: This does not look very different from an ordinary pattern matching definition, but the point is that a match can be used anywhere in an expression, and with arbitrary arguments.
ko: 이것은 평범한 패턴 매칭 정의와 아주 달라보이지 않지만 match가 임의의 인수로 표현식의 어디서든 사용될 수 있다는 점이 다릅니다.

source: This example is similar to the previous one, but now an input to sum_example is implicitly either of the form inl n or inr n.
ko: 이 예제는 이전의 것과 닮았습니다. 하지만 sum_example의 입력이 이제 암시적으로 inl n이나 inr n의 꼴 둘 중의 하나입니다.

source: This example simultaneously introduces the inductive type, Prod, its constructor, mk, the usual eliminators (rec and recOn), as well as the projections, fst and snd, as defined above.
ko: 이 예제는 동시에 귀납형 Prod과 그것의 생성자 mk, 평범한 제거자 (rec과 recOn) 뿐만 아니라 위에서 정의한 대로 투영 fst과 snd을 도입합니다.

source: This explains the type annotation of the function List:
ko: 이는 List함수의 유형 표기를 설명합니다.

source: This feature allows us to simulate a form of inheritance.
ko: 이 기능은 우리가 상속(inheritance)의 형태를 모사하도록 허용합니다.

source: This feature of the framework is so important that the library defines a notation rfl for Eq.refl _:
ko: 프레임워크의 이 특징은 너무 중요해서 라이브러리가 Eq.refl _에 대한 기호 rfl을 정의합니다.

source: This function is used by the #eval command to display Weekday objects.
ko: 이 함수는 Weekday 대상을 표시하도록 #eval 명령으로 사용됩니다.

source: This gives you a way of creating pairs of natural numbers.
ko: 이는 여러분에게 자연수의 쌍을 만들 수 있는 방법을 줍니다.

source: This gives you a way of extracting its two components.
ko: 이는 여러분에게 순서쌍의 두 성분을 추출하는 방법을 줍니다.

source: This guarantees that Lean will favor other instances and fall back on propDecidable only after other attempts to infer decidability have failed.
ko: 이렇게 하면 린이 다른 개체를 선호하고 결정가능성을 추론하려는 다른 시도가 실패한 후에만 propDecidable으로 후퇴함을 보장합니다.

source: This instructs Lean's elaborator to use the value T as the type of e when trying to resolve implicit arguments.
ko: 이것은 린의 협력기가 암시적 인수를 해결하려고 시도할 때 e의 유형으로 T값을 사용하라고 지시합니다.

source: This is followed by nested case splits on the next two arguments, and in each case the equation compiler rules out the cases are not compatible with the first pattern.
ko: 이것은 다음 두 인수에 대한 중첩된 경우 분할을 따르고 각 경우에서 방정식 컴파일러는 첫 번째 패턴과 적합하지 않은 경우를 배제합니다.

source: This is known as an "implicit argument."
ko: 이것은 "암시적 인자"라고 합니다.

source: This is a central feature of dependent type theory: terms carry a lot of information, and often some of that information can be inferred from the context.
ko: 이는 의존 유형론의 핵심 특징입니다. 항은 많은 정보를 전달하고 종종 그 정보의 몇은 맥락으로부터 추론될 수 있습니다.

source: This is a good place to introduce another device Lean offers to help structure long proofs, namely, the have construct, which introduces an auxiliary subgoal in a proof.
ko: 이곳은 린이 긴 증명을 구조화하도록 돕는 또다른 장치를 도입하기에 적절합니다. 주로 have 생성자인데 이는 증명의 보조적인 세부목표를 도입합니다.

source: This is a good place to mention another inductive type, denoted {x : α // p}, which is sort of a hybrid between ∃ x : α, P and Σ x : α, P.
ko: 여기서 또 다른 귀납형 ∃ x : α, P과 Σ x : α, P이 섞인 {x : α // p}으로 나타낸 귀납형을 얘기하기 좋은 곳 같습니다.

source: This is a notoriously inefficient way of computing the fibonacci function, however, with an execution time that is exponential in n.
ko: 이것은 계산 시간이 n에 대해 지수적인 피보나치 함수를 계산하는 악명높게 비효율적인 방식이지만

source: This is an instance of a dependent function type, or dependent arrow type.
ko: 이것은 의존적 함수 유형 또는 의존적 방향 유형의 개체입니다.

source: This is consistent with the understanding that if p : Prop, an element hp : p carries no data.
ko: 이것은 p : Prop이면 원소 hp : p는 아무 데이터도 나르지 않는다는 것의 이해와 일관됩니다.

source: This is done by putting the arguments in curly braces, as follows:
ko: 이것은 다음과 같이 인수를 중괄호 안에 두는 것으로 할 수 있습니다.

source: This is especially useful when the resulting goals can be finished off in a uniform way, or, at least, when it is possible to make progress on all of them uniformly.
ko: 이는 특히 출력되는 목표가 균일한 방식으로 마무리 될 때 혹은 적어도 출력목표가 모두를 균일한 방식으로 진전을 만드는게 가능할 때 유용합니다.

source: This is essentially just alternative notation for the match construct above.
ko: 이것은 본질적으로 위의 match 생성을 위한 대체 기호일 뿐입니다.

source: This is illustrated in the following example, in which we set the option pp.explicit to true to ask Lean's pretty-printer to show the implicit arguments.
ko: 이것은 다음 예제에서 보여주고 있습니다. 여기서 암시적 인자를 보여주는데 린의 깔끔한 출력을 사용하도록 pp.explicit 옵션을 참으로 설정하였습니다.

source: This is known as proof irrelevance, and is consistent with the interpretation in the last paragraph.
ko: 이것은 증명 무연관으로 알려져 있고 이것은 마지막 문단에서 해석과 일관성이 있습니다.

source: This is known as a nested inductive type.
ko: 이것은 중첩된(nested) 귀납형으로 알려져 있습니다.

source: This is necessary because these types are part of the Lean "prelude" that is automatically imported when the system is started.)
ko: 이것은 이들 유형이 시스템이 시작할 때 자동적으로 불러와지는 린 "서막"의 일부이기 때문에 필요합니다.

source: This is often used for names like Nat.rec and Nat.recOn, to prevent overloading of common names.
ko: 흔한 이름들의 과부하를 막기 위해 Nat.rec과 Nat.recOn 같은 이름들에 종종 사용됩니다.

source: This is often useful as well.
ko: 이것도 또한 종종 유용합니다.

source: This is particularly important when we have implemented only the instance HMul α α α, and did not implement HMul Nat α α.
ko: 이것은 우리가 개체 HMul α α α만 구현하고 HMul Nat α α을 구현하지 않았을 때 특히 중요합니다.

source: This is similar to the way that computer scientists occasionally blur the distinction between syntax and semantics by saying, at times, that a program "computes" a certain function, and at other times speaking as though the program "is" the function in question.
ko: 이것은 컴퓨터 과학자들이 때때로 프로그램이 특정 함수를 "계산"한다고 말함으로써 문법과 의미론의 구분을 모호하게 하는 방식과 유사합니다. 그리고 다른 때에는 프로그램이 문제의 함수인 것처럼 말합니다.

source: This is the approach followed in the Calculus of Constructions, and hence in Lean as well.
ko: 이는 직관주의적 계산법에 따른 접근법입니다. 그리고 이는 린에서도 마찬가지 입니다.

source: This is the elimination rule.
ko: 이것은 제거 규칙입니다.

source: This is the introduction rule.
ko: 이것은 도입 규칙입니다.

source: This is tricky; you will have to define an auxiliary function.
ko: 이것은 교활해서 여러분은 부가함수를 정의해야만 할 것입니다.

source: This is why the numeral 2 has type Nat when the expected type is not known.
ko: 이것이 기대되는 유형을 모를 때 수치값 2가 Nat형이 되는 이유입니다.

source: This kind of instance is only active when you are inside of the namespace or open the namespace.
ko: 이런 종류의 개체는 여러분이 이름공간 안에 있거나 이름공간을 개방했을 때에만 활동적입니다.

source: This looks exactly like the definition of the constant function in the last chapter, the only difference being that the arguments are elements of Prop rather than Type.
ko: 이는 지난 장에서 상수함수의 정의와 완전히 동일하게 보입니다. 유일한 차이는 인수는 Prop의 원소 보다는 Type의 원소라는 것입니다.

source: This makes the first argument to ident implicit.
ko: 이 첫 인수는 ident를 암시적으로 만듭니다.

source: This manual is generated by mdBook.
ko: 이 메뉴얼은 mdBook으로 생성되었습니다.

source: This may often be too restrictive.
ko: 이것은 종종 너무 제한적일 수 있습니다.

source: This means compose is a function that takes any two functions as input arguments, so long as those functions each take only one input.
ko: 이는 compose가 하나의 입력만 받는 함수인 경우에만 임의의 두 함수를 입력 인수로 받는 함수임을 의미합니다.

source: This means compose can compose just about any 2 functions so long as they each take one parameter, and so long as the type of output of the second matches the input of the first.
ko: 이는 compose가 그들이 입력받는 두 함수 각각이 한 매개변수만 받고 두번째 함수의 출력 유형이 첫번째 함수의 입력 유형과 같은 한 합성할 수 있다는 것을 의미합니다.

source: This means simply that any argument to the constructor in which it occurs is a dependent arrow type in which the inductive type under definition occurs only as the resulting type, where the indices are given in terms of constants and previous arguments.
ko: 이 의미는 단순히 그것이 발생하는 생성자에서 임의의 인자가 귀납형이 정의 하에서 결과적인 유형으로써만 일어나는 의존 화살표 유형임을 의미합니다. 여기서 색인은 상수와 이전의 인수에 대해서 제시됩니다.

source: This means that the system maintains an internal ordering of terms, and only applies the identity if doing so decreases the order.
ko: 이는 시스템이 항들의 내부적인 순서를 유지한다는 의미일 뿐만 아니라 만약 무한루프가 유발된다면 항등식들의 순위를 줄이도록 적용합니다.

source: This means that whenever you write t, a placeholder, or "hole," is inserted, so that t is replaced by @t _.
ko: 이는 우리가 t를 쓰는 언제든지 자리차지자 혹은 "구멍"이 삽입되고 t는 @t _로 대체됨을 의미합니다.

source: This might look more familiar to you if you know how functions work in other programming languages.
ko: 다른 프로그래밍언어에서 함수가 어떻게 동작하는지 안다면 이게 여러분에게 더 친숙하게 보일지 모르겠습니다.

source: This mode allows to travel inside assumptions and goals, even inside function abstractions and dependent arrows, to apply rewriting or simplifying steps.
ko: 이 모드를 사용하면 가정과 목표 속과 심지어 함수 추상화 및 종속 화살표 내부를 이동하여 다시쓰기 또는 단순화 단계를 적용할 수 있습니다.

source: This provides a quick and convenient way to begin experimenting with the system.
ko: 이는 실험적으로 시스템을 시작하는데 편리하고 빠른 방법을 제공합니다.

source: This provides a compact way of unpacking hypotheses that make use of logical connectives.
ko: 이것은 논리연결사가 사용된 가정을 펼치는 간소한 방식을 제공합니다.

source: This provides a convenient way of accessing functions without opening a namespace.
ko: 이는 이름공간을 열지 않고 함수에 접근하는 편리한 방법을 줍니다.

source: This provides a convenient way of accessing the fields of a structure.
ko: 이것은 구조체의 필드에 접근하는 편리한 방법을 제공합니다.

source: This reflects the interpretation of Prop as the type of propositions rather than data, and it is what makes Prop impredicative.
ko: 이것은 데이터보다는 명제의 유형으로써 Prop의 해석을 반영했습니다. 그리고 이것이 Prop을 impredicative하게 만드는 것입니다.

source: This rule is sometimes called ex falso (short for ex falso sequitur quodlibet), or the principle of explosion.
ko: 이 규칙은 때때로 ex falso (라틴어 ex falso sequitur quodlibet을 줄인 것), 또는 폭발의 원리(principle of explosion)라고 불립니다.

source: This section provides additional information for those interested in the axiomatic foundations.
ko: 이 섹션은 공리적 기초에 대해 흥미로워하는 이들을 위한 추가 정보를 제공합니다.

source: This sets a very high standard: every rule of inference and every step of a calculation has to be justified by appealing to prior definitions and theorems, all the way down to basic axioms and rules.
ko: 이것은 아주 높은 기준을 설정합니다. 모든 추론 규칙과 계산의 모든 계산 과정은 선행된(기초 공리와 규칙으로 거슬러 내려가는) 정의와 정리에 호소하여 정당화되어야 합니다.

source: This simple device is extremely useful when it comes to structuring long proofs, since we can use intermediate have's as stepping stones leading to the final goal.
ko: 이 단순한 장치는 긴 증명을 구조화 해야 할 때 아주 유용합니다. 왜냐하면 우리는 간간히 have를 최종 목표로 이끄는 주춧돌로써 쓰기 때문입다.

source: This tells Lean to use the assumption tactic, which, in turn, proves the goal by finding a suitable hypothesis in the local context.
ko: 이것은 린에게 assumption 전략을 사용하라고 말합니다. 따라서 이 전략은 현재 상황판에서 적절한 가정을 찾아 목표를 증명합니다.

source: This tutorial describes the current version of Lean, known as Lean 4.
ko: 이 튜토리얼은 린의 현재 버전(린 4)를 설명합니다.

source: This tutorial is an open access project maintained on Github.
ko: 이 튜토리얼은 깃허브로 관리되어 누구나 접근할 수 있는 프로젝트입니다.

source: This type depends on two parameters: the type of the elements in the vector (α : Type) and the length of the vector n : Nat.
ko: 이 유형은 두 매개변수에 의존합니다. 하나는 벡터의 원소의 유형 (α : Type)이고 또 다른 하나는 벡터의 길이n : Nat입니다.

source: This underscore is known as a wildcard pattern, or an anonymous variable.
ko: 이 밑줄 문자는 와일드카드 패턴(wildcard pattern)혹은 익명 변수(anonymous variable)로 알려져 있습니다.

source: This version of add is the Lean analogue of the Haskell term add :: Add a => a -> a -> a.
ko: add의 이 버전은 하스켈 항 add :: Add a => a -> a -> a의 린 닮은꼴입니다.

source: This version of the text assumes you’re using Lean 4.
ko: 이 버전의 책은 여러분이 Lean 4를 사용한다고 가정합니다.

source: Those not inclined to this ideology can view it, rather, as a simple coding trick.
ko: 이 이데올로기에 편향되지 않은 사람들은 꽤나 단순한 코딩 트릭으로 볼 것입니다.

source: Throughout the text you will find examples of Lean code like the one below:
ko: 이 교재에서 여러분은 아래와 같은 린 코드 예제를 보게 될 겁니다.

source: Thus all theorems in the library that rely on decidability assumptions are freely available when you want to reason classically.
ko: 따라서 결정가능성 가정에 의존하는 라이브러리 속 모든 정리는 여러분이 고전적으로 추론하는 것을 원할 때 자유롭게 이용할 수 있습니다.

source: Thus both of the following proofs of zero_add work:
ko: 따라서 zero_add의 다음 증명들은 모두 작동합니다.

source: Thus if the application of theorem foo to a single goal produces four subgoals, one would expect the proof to look like this:
ko: 따라서 foo 정리를 한 목표에 적용하여 네 개의 하위 목표를 만들려고 한다면 누군가는 이 같은 증명을 기대할 것입니다.

source: Thus namespaces give you a way to manage names in your working environment.
ko: 따라서 이름공간은 당신의 작업 환경 속에 이름을 관리하는 방법을 줍니다.

source: Thus the proof term above could be written more concisely:
ko: 따라서 위의 증명 항을 더 간결하게 쓸 수 있습니다.

source: Thus the string a + b + c cannot be parsed as the equivalent of a + (b + c) because the right-hand side operand of an infixl notation has precedence one greater than the notation itself.
ko: 따라서 문자열 a + b + c는 a + (b + c)와 동등한 것으로 분석될 수 없습니다. 왜냐하면 infixl표기의 우변의 피연산자가 그 자체의 표기보다 하나 큰 우선순위를 갖기 때문입니다.

source: Thus the term is equivalent to a ~ (b ~ c).
ko: 따라서 항은 a ~ (b ~ c)과 동등합니다.

source: Thus we can carry out definitions by cases on decidable predicates on the natural numbers:
ko: 따라서 우리는 자연수에 대해 결정가능 술어에 대한 각 경우에 대해 정의를 이끌어 냅니다.

source: Thus we can think of an element f of the type α → Option β as being a partial function from α to β: for every a : α, f a either returns none, indicating the f a is "undefined", or some b.
ko: 따라서 우리는 α → Option β형의 원소 f를 모든 a : α에 대한 α에서 β까지의 부분함수인 것으로 생각할 수 있습니다. f a f a가 "정의되지 않음"을 가리키는 none을 반환하거나 some b을 반환합니다.

source: Thus you can view Nat.add as a function that takes a natural number and returns another function that takes a natural number and returns a natural number.
ko: 따라서 여러분은 Nat.add은 자연수를 받아 자연수를 받고 자연수를 반환하는 또 다른 함수를 반환하는 함수로 볼 수 있습니다.

source: Thus, Lean 4 implements a new feature, discriminant refinement, which includes these extra discriminants automatically for us.
ko: 따라서 린4에서 별도의 구별자를 자동적으로 포함시켜주는 새로운 기능 discriminant refinement을 구현했습니다.

source: Thus, all four of these definitions have the same net effect.
ko: 따라서 이 모든 네 정의들은 동일한 알짜 효과를 갖습니다.

source: Thus, for example, we can specialize the example from the previous section to the equality relation:
ko: 따라서, 우리는 이전 섹션에서 동등 관계까지의 예를 특수화 할 수 있습니다.

source: Thus, the standard library assigns a low priority to the propDecidable instance.
ko: 따라서 표준 라이브러리는 propDecidable 개체에 낮은 우선 순위를 할당합니다.

source: Thus, type class synthesis only starts after these two types are known.
ko: 따라서 유형 클래스 합성은 이 두 유형이 알려진 뒤에야 시작합니다.

source: Thus, you can use the local modifier to indicate that they only have effect until the current section or namespace is closed, or until the end of the current file.
ko: 따라서 여러분은 local 수정자로 그들이 오직 현재 닫힌section이나 namespace까지만 혹은 현재 파일의 끝까지만 유효함을 나타내는데 사용할 수 있습니다.

source: Thus, you can disable it using the command set_option autoImplicit false.
ko: 따라서 여러분은 이것을 set_option autoImplicit false 명령을 써서 해제할 수 있습니다.

source: To define the function inverse below, we have to mark f a inaccessible.
ko: 아래에서 함수 inverse를 정의하려면 우리는 f a를 접근 불가한 것으로 표시해야만 합니다.

source: To prove that assertion, we need to exhibit a term t : p.
ko: 주장을 증명하는 것은 t : p의 항으로 나타낼 필요가 있습니다.

source: To build this manual, first install the fork via
ko: 이 메뉴얼을 생성하려면 fork를 다음을 거쳐 설치해야합니다.

source: To define a function on Prod α β, we can assume the input is of the form Prod.mk a b, and we have to specify the output, in terms of a and b.
ko: Prod α β에서 함수를 정의하기 위해서 우리는 입력의 형태가 Prod.mk a b이라 가정할 수 있습니다. 그리고 a와 b에 대해 출력을 명시해야 합니다.

source: To define a function on Sum α β, we have to handle two cases: either the input is of the form inl a, in which case we have to specify an output value in terms of a, or the input is of the form inr b, in which case we have to specify an output value in terms of b.
ko: Sum α β에 함수를 정의하기 위해서 우리는 두 경우를 다뤄야 합니다. 입력이 inl a의 꼴인 경우 우리는 출력값을 a에 대해 나타내야 하고 혹은 입력이 inr b꼴인 경우 우리는 출력값을 b에 대해 나타내야 합니다.

source: To define polymorphic constants, Lean allows you to declare universe variables explicitly using the universe command:
ko: 다형적인 상수를 정의하기 위해 린은 여러분이 세계 변수를 universe 명령을 명시적으로 사용하여 선언할 수 있게 했습니다.

source: To define that function, Lean uses a suitable well-founded measure.
ko: 이런 함수를 정의하려면 린은 적절히 잘 세워진 척도를 사용합니다.

source: To each proposition p we associate a type that is empty if p is false and has a single element, say *, if p is true.
ko: 각 명제 p에 대해, 우리는 p이 거짓이면 원소가 없고, p가 참이면 한 원소(예: *)가 있는 유형을 연관시킵니다.

source: To formally express a mathematical assertion in the language of dependent type theory, we need to exhibit a term p : Prop.
ko: 의존 유형론의 언어로 수학적 주장을 형식적으로 표현하기 위해 p : Prop에 대한 항으로 나타낼 필요가 있습니다.

source: To get used to using universal quantifiers, you should try some of the exercises at the end of this section.
ko: 전칭 한정기호 사용에 익숙해지기 위해서 여러분은 이 섹션 끝의 연습문제들을 풀어보아야 합니다.

source: To handle structural recursion, the equation compiler uses course-of-values recursion, using constants below and brecOn that are automatically generated with each inductively defined type.
ko: 구조적 재귀를 다루려고 방정식 컴파일러는 각 귀납적으로 정의된 유형으로부터 자동적으로 생성된 상수 below와 brecOn을 사용하여 course-of-values재귀를 사용합니다.

source: To help debug in these situations, Lean enables you to request a trace of the search:
ko: 이러한 상황에서 디버그를 돕기 위해 Lean을 사용하면 검색 추적을 요청할 수 있습니다.

source: To illustrate the difference, consider the following example, which shows that a reflexive euclidean relation is both symmetric and transitive.
ko: 차이를 설명하자면 유클리드 관계의 반사성은 모두 대칭적이고 추이적임을 보이는 다음 예제를 생각해보세요.

source: To make dite more convenient to use, Lean allows us to write if h : c then t else e instead of dite c (λ h : c, t) (λ h : ¬ c, e).
ko: dite를 사용하기 더 편리하게 만들기 위해 린은 우리가 dite c (λ h : c, t) (λ h : ¬ c, e) 대신 if h : c then t else e로 쓸 수 있게 해줍니다.

source: To preserve the validity of the previous goal, the generalize tactic allows us to record the fact that 3 has been replaced by x.
ko: 앞선 목표의 유효성을 보존하기 위해 generalize 전략은 3이 x로 대체되었음에 대한 사실을 기록하게 해줍니다.
